Repository: CTSRD-CHERI/gxemul
Catalog: po/*.po
Languages: sv

source: Saves the emulation to a file.
sv: Sparar emuleringen till en fil.

source: Saves the entire emulation setup, or a part of it, to a file in the filesystem. The filename may be omitted, if it is known from an earlier save or load command. If the component path is omitted, the entire emulation setup is saved. See also: load (to load an emulation setup)
sv: Sparar hela emuleringen, eller en del av den till en fil i filsystemet. Filnamnet behöver ej anges, om det angavs i en tidigare användning av save- eller 'load-kommandona. Om sökvägen till komponenten inte anges så sparas hela emuleringen, annars bara den del som anges av sökvägen. Se även: load (för att ladda in en emulering)

source: Loads an emulation from a file.
sv: Laddar in en emulering från en fil.

source: Loads an entire emulation setup, or a part of it, from a file in the filesystem. The filename may be omitted, if it is known from an earlier save or load command. If the component path is omitted, the loaded emulation replaces any currently loaded emulation. If a component path is specified, the new component is added as a child to that path. See also: save (to save an emulation to a file)
sv: Laddar en emulering, eller en del av en emulering, från en fil. Filnamnet kan hoppas över, om ett filnamn är känt från ett tidigare 'load'- eller 'save'-kommando. Om komponentsökvägen hoppas över så ersätts hela nuvarande komponentträdet med det som laddas, annars läggs det laddade trädet till på den givna komponentsökvägen. Se även: save (för att spara emuleringen till en fil)

source: Removes a component from the emulation.
sv: Tar bort en komponent ur emuleringen.

source: Removes a component (given a path) from the current emulation setup. See also: add (to add new components) tree (to inspect the current emulation setup)
sv: Tar bort en komponent (givet en sökväg) från emuleringen. Se även: add för att lägga till komponenter tree för att se nuvarande emuleringens komponentträd

source: Displays all available components.
sv: Visar alla tillgängliga komponenter.

source: Displays a list of all available components.
sv: Visar en lista av alla tillgängliga komponenter.

source: Quits the application.
sv: Avslutar applikationen.

source: Shows the current status (runstate etc).
sv: Visar nuvaranda kör-status.

source: Shows the current status. This currently includes: o) Runstate (Running or Paused)
sv: Visar körstatus. För närvarande visas följande: o) Runstate (Kör eller Pausad)

source: Continues the current emulation.
sv: Fortsätter körning av nuvarande emulering.

source: Continues the emulation, by setting the current RunState to Running.
sv: Fortsätter körning av den laddade emuleringen.

source: Discards (closes) the current emulation.
sv: Stänger nuvarande emulering.

source: Closes (discards) the current emulation. See also: load (to load an existing emulation)
sv: Stänger nuvarande emulering. Se även: load (för att ladda en existerande emulering)

source: Undoes the last action.
sv: Ångrar senaste ändringen.

source: Undoes the last action, if possible. See also: redo
sv: Ångrar senaste ändringen, om det är möjligt. Se även: redo

source: Prints version information.
sv: Skriver ut versionsinformation.

source: root Shows the entire component tree.
sv: root Visar hela komponentträdet.

source: <name> Shows the component tree, from the named component.
sv: <namn> Visar komponentträdet för en given komponent.

source: <name>.<method> Executes a method of a named component.
sv: <namn>.<metod> Kör en metod på en given komponent.

source: <name>.<var> Prints the value of a variable of a named component.
sv: <namn>.<var> Visar värdet av en variabel för en given komponent.

source: <name>.<var> = <value> Assigns a value to a variable of a named component.
sv: <namn>.<var> = <värde> Tilldelar ett värde till en komponents variabel.

source: Shows a help message.
sv: Visar hjälp.

source: Shows a summary of all available commands, or, when given a specific command name as an argument, shows a detailed description about that command.
sv: Visar en översikt över alla tillgängliga kommandon. Om ett specifikt kommando anges som argument visas en detaljerad beskrivning av det kommandot.

source: Redoes the next action, if possible.
sv: Gör om nästa ändring, om möjligt.

source: Redoes the next action on the action stack, if possible. See also: undo
sv: Gör om nästa ändring, om möjligt. Se även: undo

source: Adds a component to the emulation.
sv: Lägger till en komponent till emuleringen.

source: Resets the current emulation.
sv: Nollställer nuvarande emulering.

source: Pauses the current emulation.
sv: Pausar körningen.

source: The -e option is deprecated. Use -E instead.
sv: -e-flaggan används ej längre. Använd -E istället.

source: It is possible that you are attempting to use an option which was available in older versions of GXemul, but has not been reimplemented in GXemul 0.5.x. Please see the man page or the gxemul -h help message for available options.
sv: Möjligen försöker du använda kommandoradsargument som fanns i en tidigare version av GXemul, men inte ännu har hunnit reimplementeras i den här versionen. Var god läs manual-sidan eller kör gxemul -h för att få hjälp om tillgängliga kommandoradsargument.

source: Failed to create configuration from template:
sv: Misslyckades med att skapa en konfiguration från templat:

source: Aborting.
sv: Avbryter.

source: Failed to load binary:
sv: Misslyckades med att ladda binärfilen:

source: Failed to load configuration:
sv: Misslyckades med att ladda konfiguration:

source: More than one configfile name supplied on the command line?
sv: Mer än ett namn på en konfigurationsfil angavs på kommandoraden?

source: No binary specified. Aborting.
sv: Ingen binärfil angiven. Avbryter.

source: Insufficient command line arguments given to start an emulation. You have the following alternatives:
sv: Otillräckliga kommandoradsargument för att påbörja en emulering. Du har följande alternativ:

source: 1. Run gxemul with machine selection options (-E), which creates a default emulation from a template machine. 2. Run gxemul with a configuration file (.gxemul). 3. Run gxemul -V with no other options, which causes gxemul to be started with no emulation loaded at all. 4. Run gxemul-gui which starts the GUI version of GXemul.
sv: 1. Kör gxemul med argument för maskinval (-E), som skapar en standard- emulering från ett templat. 2. Kör gxemul med en konfigurationfil (.gxemul). 3. Kör gxemul -V utan övriga argument; detta startar GXemul utan att ladda någon emulering. 4. Kör gxemul-gui för att starta GXemul med grafiskt användargränssnitt.

source: Run gxemul -h for help on command line options.
sv: Kör gxemul -h för att få hjälp angående kommandoradsflaggor.

source: Usage: gxemul [general options] [configfile] gxemul [general options] [machine selection options] binary [...] gxemul-gui [general options] [configfile] gxemul-gui [general options] [machine selection options] binary [...]
sv: Användnig: gxemul [allmänna flaggor] [konfigurationsfil] gxemul [allmänna flaggor] [maskinvalsflaggor] [binär...] gxemul-gui [allmänna flaggor] [konfigurationsfil] gxemul-gui [allmänna flaggor] [maskinvalsflaggor] [binär...]

source: Sorry, this installation of GXemul was compiled without GUI support.
sv: Tyvärr, denna installation av GXemul byggdes utan GUI.

source: ### FATAL ERROR ###
sv: ### FATALT FEL ###

source: If you are able to reproduce this crash, please send detailed repro-steps to the author, to the gxemul-devel mailing list, or ask in #GXemul on the FreeNode IRC network.
sv: Om du lyckas reproducera den här krashen, var god sänd detaljerade repro-steps till upphovsmannen, till mailinglistan 'gxemul-devel', eller fråga i kanalen #GXemul på IRC-nätverket FreeNode.

source: Not running
sv: Kör ej

source: Paused
sv: Pausad

source: Running
sv: Kör

source: Quitting
sv: Avslutar

source: Unknown RunState
sv: Okänt RunState

source: Methods:
sv: Metoder:

source: Variables:
sv: Variabler:

source: bytes
sv: byte

source: at offset
sv: på offset

source: memory could not be read
sv: minnet kunde inte läsas

source: _Blank emulation
sv: _Tom emulering

source: Create a new blank emulation
sv: _Tom emulering

source: From _template
sv: _Från templat

source: Create a new emulation from a template
sv: Skapa en ny emulering från ett templat

source: _File
sv: _Arkiv

source: _New
sv: _Ny

source: _Open
sv: _Öppna

source: Open an emulation setup
sv: Öppna en existerande emulering

source: _Save
sv: _Spara

source: Save the emulation setup
sv: Spara emuleringen till en fil

source: Save _as
sv: S_para som

source: _Quit
sv: _Avsluta

source: Quit the application
sv: Avsluta applikationen

source: _Edit
sv: _Redigera

source: _Undo
sv: _Ångra

source: Undo the last action
sv: Ångra senaste ändringen

source: _Redo
sv: _Upprepa

source: Redo the next action, if possible
sv: Gör om nästa ändring, om möjligt

source: Pre_ferences
sv: _Inställningar

source: _Run
sv: _Kör

source: Run the emulation
sv: Kör emuleringen

source: _Pause
sv: _Pausa

source: Pause the emulation
sv: Pausar emuleringen

source: E_mulation
sv: E_mulering

source: R_eset
sv: _Omstart

source: Reset the emulation to its initial state
sv: Återställ emuleringens tillstånd till utgångsläget

source: _Help
sv: _Hjälp

source: If you have questions or feedback, don't hesitate to mail me. anders@gavare.se
sv: Om du har frågor eller vill lämna annan feedback, maila mig på följande adress: anders@gavare.se

source: New blank emulation
sv: Ny tom emulering

source: Choose Save to save your work, or New to start with a blank emulation without saving.
sv: Välj Spara för att spara ditt arbete, eller Ny för att skapa en ny blank emulering, utan att spara den nuvarande.

source: New emulation from template
sv: Skapa ny emulering från ett templat

source: Choose Save to save your work, or New to create an emulation from a template without saving.
sv: Välj Spara för att spara ditt arbete, eller Ny för att skapa en ny emulering från ett templat, utan att spara den nuvarande.

source: Open emulation
sv: Öppna en ny emulering

source: Choose Save to save your work, or Open to open a new emulation without saving.
sv: Välj Spara för att spara ditt arbete, eller Öppna för att öppna en annan emulering utan att spara den nuvarande.

source: Choose an emulation to open
sv: Välj en emulering

source: GXemul files
sv: GXemul-filer

source: Any files
sv: Alla filer

source: Quit
sv: Avsluta

source: Choose Save to save your work, or Quit to quit the application without saving.
sv: Välj Spara för att spara ditt arbete, eller Avsluta för att avsluta utan att spara.

source: Your current emulation setup has not been saved.
sv: Din nuvarande emulering har inte ännu sparats.

source: Choose a name for the emulation (.gxemul)
sv: Välj ett namn för emuleringen (.gxemul)
